# **BMW SQL QUERIES**

This part will consist on converting the BMW data into SQL and do the following queries:

In [1]:
import pandas as pd 
import numpy as np 
from sqlalchemy import create_engine
import sqlalchemy

We connect with MySQL and see what tables we have.

In [2]:
# instanciamos engine como resultado de create_engine
cadena_conexion='mysql+mysqlconnector://root:carlos1234@localhost/NUCLIO'
con = sqlalchemy.create_engine(cadena_conexion).connect()

In [3]:
# Comprobamos el contenido de la base de datos NUCLIO. Deberían aparecer las de ventas.
pTablas = con.execute("SHOW TABLES")
pTablas.fetchall()

[('clientes',), ('oficinas',), ('productos',), ('vendedores',), ('ventas',)]

We read the BWM dataset and convert it to SQL with .to_sql command. And we finally check what tables we have in this connection.

In [5]:
bmw_df = pd.read_csv("/Users/carlosperezricardo/Documents/DataScience/NuclioDS/bmw_pricing_v2.csv", skipinitialspace=True)
bmw_df.head()

,marca,modelo,km,potencia,fecha_registro,tipo_gasolina,color,tipo_coche,volante_regulable,aire_acondicionado,camara_trasera,asientos_traseros_plegables,elevalunas_electrico,bluetooth,gps,alerta_lim_velocidad,precio,fecha_venta
0,BMW,118,140411.0,100.0,2012-02-01,diesel,black,convertible,True,True,False,False,True,True,True,False,11300.0,2018-01-01
1,BMW,M4,13929.0,317.0,2016-04-01,petrol,grey,convertible,True,True,False,False,False,True,True,True,69700.0,2018-02-01
2,BMW,320,183297.0,120.0,2012-04-01,diesel,white,convertible,False,False,False,False,True,False,True,False,10200.0,2018-02-01
3,BMW,420,128035.0,135.0,2014-07-01,diesel,red,convertible,True,True,False,False,True,True,True,True,25100.0,2018-02-01
4,BMW,425,97097.0,160.0,2014-12-01,diesel,silver,convertible,True,True,False,False,False,True,True,True,33400.0,2018-04-01

In [6]:
bmw_df.to_sql('bmw', if_exists='replace', con=con, index=False)

In [7]:
pTablas = con.execute("SHOW TABLES")
pTablas.fetchall()

[('bmw',),
 ('clientes',),
 ('oficinas',),
 ('productos',),
 ('vendedores',),
 ('ventas',)]


- List of vehicles grouped by model and fuel type. (Hacer un listado de los vehículos agrupados por el modelo y tipo de gasolina.)

In [10]:
sSQL = """ 
        SELECT modelo, tipo_gasolina
        FROM bmw
        GROUP BY 1, 2
        """
result = pd.read_sql(sSQL, con=con)

for i, row in result.iterrows():
    print(row['modelo'], ':', row['tipo_gasolina'])

118 : diesel
M4 : petrol
320 : diesel
420 : diesel
425 : diesel
335 : petrol
325 : diesel
118 : petrol
Z4 : petrol
120 : diesel
220 : petrol
650 : petrol
135 : petrol
218 : petrol
220 : diesel
318 : petrol
430 : diesel
218 : diesel
M3 : petrol
330 : diesel
420 : petrol
225 : diesel
M235 : petrol
316 : petrol
435 : petrol
640 : diesel
640 Gran Coupé : diesel
435 Gran Coupé : diesel
420 : None
i8 : hybrid_petrol
320 : petrol
435 : diesel
630 : petrol
430 Gran Coupé : diesel
325 : petrol
335 : diesel
635 : diesel
318 : diesel
520 : diesel
316 : diesel
None : diesel
525 : diesel
320 : None
530 : diesel
530 : petrol
535 : diesel
320 Gran Turismo : diesel
525 : petrol
518 : diesel
520 : petrol
116 : diesel
318 : None
328 : petrol
523 : petrol
X3 : diesel
M550 : diesel
116 : petrol
528 : petrol
325 Gran Turismo : diesel
125 : diesel
318 Gran Turismo : diesel
420 Gran Coupé : diesel
i3 : hybrid_petrol
114 : diesel
520 Gran Turismo : diesel
530 Gran Turismo : diesel
i3 : electro
M135 : petrol
418 Gran Coupé : diesel
330 Gran Turismo : diesel
120 : petrol
435 Gran Coupé : petrol
335 Gran Turismo : diesel
730 : diesel
114 : petrol
123 : diesel
320 Gran Turismo : petrol
535 Gran Turismo : petrol
535 : petrol
740 : diesel
750 : diesel
740 : petrol
535 Gran Turismo : diesel
ActiveHybrid 5 : hybrid_petrol
735 : petrol
M5 : petrol
X5 : diesel
X1 : diesel
X4 : diesel
X6 : diesel
X1 : petrol
X6 M : diesel
X5 M : diesel
X3 : petrol
X5 : petrol
X5 : hybrid_petrol
X5 M50 : diesel
X6 M : petrol
X6 : hybrid_petrol
X6 : petrol
218 Active Tourer : diesel
218 Gran Tourer : diesel
216 : diesel
220 Active Tourer : diesel
216 Gran Tourer : diesel
216 Active Tourer : diesel
Active Tourer : diesel
218 Active Tourer : petrol
225 Active Tourer : petrol
214 Gran Tourer : diesel

- How many cars have a power greater than 150 and they are also convertible and have the steering wheel adjustable? (¿Cuantos vehículos tienen potencia superior a los 150, que sean de tipo de coche convertible y tengan el volante regulable?)

In [13]:
sSQL = """ 
        SELECT modelo, potencia, tipo_coche, volante_regulable, precio
        FROM bmw
        WHERE potencia >= 150 AND tipo_coche = 'convertible' AND volante_regulable = 1
        """
pd.read_sql(sSQL, con=con)

  modelo  potencia   tipo_coche  volante_regulable   precio
0     M4     317.0  convertible                  1  69700.0
1    425     160.0  convertible                  1  33400.0
2    335     225.0  convertible                  1  17100.0
3    650     270.0  convertible                  1   9200.0
4     Z4     180.0  convertible                  1  20800.0
5    430     190.0  convertible                  1  30100.0
6    650     270.0  convertible                  1   6800.0
7     M3     236.0  convertible                  1  12100.0
8    330     180.0  convertible                  1  15800.0

* Is there any case on which the register date is superior than the sell date? If so, calculate the mean price. (¿Podrías indicar si hay algún caso que la fecha de registro sea superior a la fecha de venta?, de ser así indicar el precio medio encontrado.)

In [30]:
sSQL = """ 
        SELECT AVG(precio)
        FROM bmw
        WHERE fecha_registro > fecha_venta
        """
con.execute(sSQL).fetchone()

(11075.0,)

* Calculate the average price of cars with air conditiong installed (Indicar el precio medio de los vehículos con aire acondicionado.)

In [31]:
sSQL = """ 
        SELECT ROUND(AVG(precio)*100)/100
        FROM bmw
        WHERE aire_acondicionado = 1
        """
con.execute(sSQL).fetchone()

(16998.12,)

* Is there any difference between the color of a vehicle and their price? Group by color and calculte the mean price (¿Existe alguna diferencia significativa entre el color del vehículos y el precio? agrupar los vehículos por su color y su precio medio para responder la pregunta.)

In [32]:
sSQL = """ 
        SELECT color, ROUND(AVG(precio)*100)/100 AS avg_price, COUNT(precio) AS number_of_cars
        FROM bmw
        GROUP BY color
        ORDER BY 2 DESC
        """
pd.read_sql(sSQL, con=con)

     color  avg_price  number_of_cars
0   orange   18866.67               6
1    white   17314.37             536
2      red   16568.63              51
3    black   16178.48            1631
4    beige   15817.07              41
5     grey   15619.91            1170
6    brown   15367.74             341
7     blue   15137.78             704
8   silver   14826.30             327
9     None   12850.00              12
10   green    7200.00              18

As we can see, orange cars are the most expensive even though the number of orange cars is 6, which is a small amount to generalize. Next ones are white, red and black cars. And the cheapest one is green.